; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-6-248)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p5-0 - location
	p5-3 - location
	p5-4 - location
	p4-1 - location
	p4-2 - location
	p0-1 - location
	p0-2 - location
	p0-4 - location
	p6-3 - location
	p6-4 - location
	p3-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s3)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s5)
	(at package2 s6)
	(at package3 s6)
	(at package4 s6)
	(at package5 s6)
	(at package6 s3)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 34)
	(= (time-to-walk p5-0 s5) 34)
	(= (time-to-walk s0 p5-0) 31)
	(= (time-to-walk p5-0 s0) 31)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 40)
	(= (time-to-walk p5-3 s5) 40)
	(= (time-to-walk s3 p5-3) 3)
	(= (time-to-walk p5-3 s3) 3)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 22)
	(= (time-to-walk p5-4 s5) 22)
	(= (time-to-walk s4 p5-4) 52)
	(= (time-to-walk p5-4 s4) 52)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 29)
	(= (time-to-walk p4-1 s4) 29)
	(= (time-to-walk s1 p4-1) 18)
	(= (time-to-walk p4-1 s1) 18)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 36)
	(= (time-to-walk p4-2 s4) 36)
	(= (time-to-walk s2 p4-2) 1)
	(= (time-to-walk p4-2 s2) 1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 45)
	(= (time-to-walk p0-1 s0) 45)
	(= (time-to-walk s1 p0-1) 89)
	(= (time-to-walk p0-1 s1) 89)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 45)
	(= (time-to-walk p0-2 s0) 45)
	(= (time-to-walk s2 p0-2) 60)
	(= (time-to-walk p0-2 s2) 60)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 68)
	(= (time-to-walk p0-4 s0) 68)
	(= (time-to-walk s4 p0-4) 79)
	(= (time-to-walk p0-4 s4) 79)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 57)
	(= (time-to-walk p6-3 s6) 57)
	(= (time-to-walk s3 p6-3) 71)
	(= (time-to-walk p6-3 s3) 71)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 87)
	(= (time-to-walk p6-4 s6) 87)
	(= (time-to-walk s4 p6-4) 36)
	(= (time-to-walk p6-4 s4) 36)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 36)
	(= (time-to-walk p3-0 s3) 36)
	(= (time-to-walk s0 p3-0) 60)
	(= (time-to-walk p3-0 s0) 60)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 37)
	(= (time-to-drive s2 s4) 37)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 85)
	(= (time-to-drive s3 s4) 85)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 43)
	(= (time-to-drive s0 s2) 43)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 31)
	(= (time-to-drive s1 s2) 31)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 60)
	(= (time-to-drive s5 s2) 60)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 27)
	(= (time-to-drive s2 s3) 27)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 72)
	(= (time-to-drive s1 s0) 72)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 51)
	(= (time-to-drive s3 s0) 51)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 63)
	(= (time-to-drive s4 s0) 63)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 69)
	(= (time-to-drive s5 s0) 69)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 24)
	(= (time-to-drive s6 s0) 24)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 25)
	(= (time-to-drive s2 s6) 25)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 37)
	(= (time-to-drive s4 s6) 37)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 48)
	(= (time-to-drive s5 s1) 48)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 74)
	(= (time-to-drive s6 s1) 74)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver3 s0)
	(at driver4 s6)
	(at truck1 s1)
	(at truck2 s3)
	(at truck4 s4)
	(at package1 s0)
	(at package2 s1)
	(at package3 s3)
	(at package4 s5)
	(at package5 s3)
	(at package6 s5)
	))

(:metric minimize (+ (* 2 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver3 s3 p3-0)
   deleted: (at driver3 s3)
   added: (at driver3 p3-0)
   goals met: 1 of 12
2. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 12
3. (walk driver3 p3-0 s0)
   deleted: (at driver3 p3-0)
   added: (at driver3 s0)
   goals met: 2 of 12
4. (walk driver4 s3 p6-3)
   deleted: (at driver4 s3)
   added: (at driver4 p6-3)
   goals met: 2 of 12
5. (walk driver4 p6-3 s6)
   deleted: (at driver4 p6-3)
   added: (at driver4 s6)
   goals met: 3 of 12
6. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 2 of 12
7. (drive-truck truck2 s2 s6 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (fuel-used) from 0 to 250
   goals met: 2 of 12
8. (load-truck package2 truck2 s6)
   deleted: (at package2 s6)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 12
9. (load-truck package3 truck2 s6)
   deleted: (at package3 s6)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 12
10. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 12
11. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 250 to 634
   goals met: 2 of 12
12. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 3 of 12
13. (drive-truck truck2 s0 s5 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 634 to 1738
   goals met: 3 of 12
14. (load-truck package1 truck2 s5)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 3 of 12
15. (drive-truck truck2 s5 s0 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 1738 to 3118
   goals met: 3 of 12
16. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 4 of 12
17. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 3118 to 3502
   goals met: 4 of 12
18. (load-truck package4 truck2 s6)
   deleted: (at package4 s6)
   added: (in package4 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 4 of 12
19. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 3502 to 3982
   goals met: 4 of 12
20. (drive-truck truck2 s0 s5 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 3982 to 5362
   goals met: 4 of 12
21. (unload-truck package4 truck2 s5)
   deleted: (in package4 truck2)
   added: (at package4 s5)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 5 of 12
22. (drive-truck truck2 s5 s0 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 5362 to 6466
   goals met: 5 of 12
23. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 4 of 12
24. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 6466 to 7282
   goals met: 5 of 12
25. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 6 of 12
26. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 7 of 12
27. (unload-truck package3 truck2 s3)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 12
28. (load-truck package6 truck2 s3)
   deleted: (at package6 s3)
   added: (in package6 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 8 of 12
29. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 7282 to 7945
   goals met: 7 of 12
30. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 7945 to 8881
   goals met: 7 of 12
31. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 12
32. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 8881 to 9222
   goals met: 8 of 12
33. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 12
34. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 9222 to 9519
   goals met: 8 of 12
35. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 8 of 12
36. (unload-truck package6 truck2 s3)
   deleted: (in package6 truck2)
   added: (at package6 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 12
37. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 9 of 12
38. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 9 of 12
39. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 9519 to 9789
   goals met: 9 of 12
40. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 12
41. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 9789 to 10039
   goals met: 8 of 12
42. (drive-truck truck4 s0 s3 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 10039 to 10549
   goals met: 8 of 12
43. (load-truck package6 truck4 s3)
   deleted: (at package6 s3)
   added: (in package6 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 8 of 12
44. (drive-truck truck4 s3 s0 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 10549 to 11110
   goals met: 8 of 12
45. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 9 of 12
46. (drive-truck truck3 s6 s2 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 11110 to 11360
   goals met: 9 of 12
47. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 12
48. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 11360 to 12053
   goals met: 9 of 12
49. (unload-truck package6 truck4 s4)
   deleted: (in package6 truck4)
   added: (at package6 s4)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 9 of 12
50. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 12053 to 12303
   goals met: 9 of 12
51. (disembark-truck driver1 truck3 s6)
   deleted: (driving driver1 truck3)
   added: (at driver1 s6) (empty truck3)
   goals met: 10 of 12
52. (drive-truck truck4 s4 s0 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 12303 to 12933
   goals met: 9 of 12
53. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 10 of 12
54. (board-truck driver4 truck3 s6)
   deleted: (at driver4 s6) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 9 of 12
55. (drive-truck truck3 s6 s4 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (fuel-used) from 12933 to 13303
   goals met: 9 of 12
56. (load-truck package6 truck3 s4)
   deleted: (at package6 s4)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 9 of 12
57. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 12
58. (drive-truck truck4 s0 s5 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   changed: (fuel-used) from 13303 to 13993
   goals met: 8 of 12
59. (drive-truck truck3 s4 s0 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 13993 to 14686
   goals met: 8 of 12
60. (drive-truck truck3 s0 s5 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 14686 to 15445
   goals met: 8 of 12
61. (unload-truck package6 truck3 s5)
   deleted: (in package6 truck3)
   added: (at package6 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 12
62. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 9 of 12
63. (drive-truck truck4 s5 s0 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   changed: (fuel-used) from 15445 to 16135
   goals met: 9 of 12
64. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 16135 to 16765
   goals met: 10 of 12
65. (walk driver4 s5 p5-4)
   deleted: (at driver4 s5)
   added: (at driver4 p5-4)
   goals met: 10 of 12
66. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 10 of 12
67. (walk driver3 s4 p0-4)
   deleted: (at driver3 s4)
   added: (at driver3 p0-4)
   goals met: 10 of 12
68. (walk driver3 p0-4 s0)
   deleted: (at driver3 p0-4)
   added: (at driver3 s0)
   goals met: 11 of 12
69. (walk driver4 p5-4 s4)
   deleted: (at driver4 p5-4)
   added: (at driver4 s4)
   goals met: 11 of 12
70. (walk driver4 s4 p6-4)
   deleted: (at driver4 s4)
   added: (at driver4 p6-4)
   goals met: 11 of 12
71. (walk driver4 p6-4 s6)
   deleted: (at driver4 p6-4)
   added: (at driver4 s6)
   goals met: 12 of 12
